In [2]:
# Import packages
import pandas as pd
from creds import host, port, database, user, password
import psycopg2

In [3]:
conn = psycopg2.connect(host=host,
                        port=port,
                        database=database,
                        user=user,
                        password=password)

In [7]:
# SQL query to get flights data
flights_df = pd.read_sql_query(('''SELECT *     
            FROM flights_api_proj_gr4
            '''), conn)
flights_df.head(2)

,flight_date,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,airline,tail_number,flight_number,origin,dest,air_time,distance,cancelled,diverted
0,2012-10-01,933.0,900,33.0,1305.0,1205,60.0,AA,N320AA,1,JFK,LAX,317.0,2475.0,0,0
1,2012-10-02,906.0,900,6.0,1200.0,1205,-5.0,AA,N319AA,1,JFK,LAX,328.0,2475.0,0,0

In [17]:
# SQL query to get flights data and airports data
flights_df = pd.read_sql_query(('''SELECT *
            FROM flights_api_proj_gr4 f
                LEFT JOIN airports a
                    ON a.faa = f.origin OR a.faa = f.dest
                WHERE ( 'BOS', 'EWR', 'JFK', 'MIA', 'PHL', 'SJU' )
            '''), conn)


# foreign_key!!!

DatabaseError: Execution failed on sql 'SELECT *
            FROM flights_api_proj_gr4 f
                LEFT JOIN airports a
                    ON a.faa = f.origin OR f.dest
            ': argument of OR must be type boolean, not type text
LINE 4:                     ON a.faa = f.origin OR f.dest
                                                   ^

In [16]:
flights_df.shape

(132218, 16)

In [15]:
flights_df = pd.read_sql_query(('''SELECT *
            FROM flights_api_proj_gr4 f
            '''), conn)

In [8]:
# SQL query to get weather data
weather_df = pd.read_sql_query(('''SELECT *
            FROM group4_weather_data
            '''), conn)
weather_df.head(2)

,time,icao,tavg,tmin,tmax,prcp,snow,wdir,wspd,wpgt,pres,tsun
0,2012-10-01,KMIA,26.7,24.4,28.3,45.0,NaN,NaN,10.8,None,1010.4,NaN
1,2012-10-02,KMIA,26.4,23.3,30.6,17.8,NaN,NaN,8.6,None,1014.4,NaN